; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; The child-snack domain 2013
;;
;; This domain is for planning how to make and serve sandwiches for a group of
;; children in which some are allergic to gluten. There are two actions for
;; making sandwiches from their ingredients. The first one makes a sandwich and
;; the second one makes a sandwich taking into account that all ingredients are
;; gluten-free. There are also actions to put a sandwich on a tray, to move a tray
;; from one place to another and to serve sandwiches.
;; 
;; Problems in this domain define the ingredients to make sandwiches at the initial
;; state. Goals consist of having all kids served with a sandwich to which they
;; are not allergic.
;; 
;; Author: Raquel Fuentetaja and Tomás de la Rosa
;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain child-snack)
(:requirements :typing)
(:types child bread-portion content-portion sandwich tray place)
(:constants kitchen - place)

(:predicates (at_kitchen_bread ?b - bread-portion)
	     (at_kitchen_content ?c - content-portion)
     	     (at_kitchen_sandwich ?s - sandwich)
     	     (no_gluten_bread ?b - bread-portion)
       	     (no_gluten_content ?c - content-portion)
      	     (ontray ?s - sandwich ?t - tray)
       	     (no_gluten_sandwich ?s - sandwich)
	     (allergic_gluten ?c - child)
     	     (not_allergic_gluten ?c - child)
	     (served ?c - child)
	     (waiting ?c - child ?p - place)
             (at ?t - tray ?p - place)
	     (notexist ?s - sandwich)
  )

(:action make_sandwich_no_gluten 
	 :parameters (?o1 - sandwich ?o2 - bread-portion ?o3 - content-portion)
	 :precondition (and (at_kitchen_bread ?o2)
			    (at_kitchen_content ?o3)
			    (no_gluten_bread ?o2)
			    (no_gluten_content ?o3)
			    (notexist ?o1))
	 :effect (and
		   (not (at_kitchen_bread ?o2))
		   (not (at_kitchen_content ?o3))
		   (at_kitchen_sandwich ?o1)
		   (no_gluten_sandwich ?o1)
                   (not (notexist ?o1))
		   ))


(:action make_sandwich
	 :parameters (?o1 - sandwich ?o2 - bread-portion ?o3 - content-portion)
	 :precondition (and (at_kitchen_bread ?o2)
			    (at_kitchen_content ?o3)
                            (notexist ?o1)
			    )
	 :effect (and
		   (not (at_kitchen_bread ?o2))
		   (not (at_kitchen_content ?o3))
		   (at_kitchen_sandwich ?o1)
                   (not (notexist ?o1))
		   ))


(:action put_on_tray
	 :parameters (?o1 - sandwich ?o2 - tray)
	 :precondition (and  (at_kitchen_sandwich ?o1)
			     (at ?o2 kitchen))
	 :effect (and
		   (not (at_kitchen_sandwich ?o1))
		   (ontray ?o1 ?o2)))


(:action serve_sandwich_no_gluten
 	:parameters (?o1 - sandwich ?o2 - child ?o3 - tray ?o4 - place)
	:precondition (and
		       (allergic_gluten ?o2)
		       (ontray ?o1 ?o3)
		       (waiting ?o2 ?o4)
		       (no_gluten_sandwich ?o1)
                       (at ?o3 ?o4)
		       )
	:effect (and (not (ontray ?o1 ?o3))
		     (served ?o2)))

(:action serve_sandwich
	:parameters (?o1 - sandwich ?o2 - child ?o3 - tray ?o4 - place)
	:precondition (and (not_allergic_gluten ?o2)
	                   (waiting ?o2 ?o4)
			   (ontray ?o1 ?o3)
			   (at ?o3 ?o4))
	:effect (and (not (ontray ?o1 ?o3))
		     (served ?o2)))

(:action move_tray
	 :parameters (?o1 - tray ?o2 ?o3 - place)
	 :precondition (and (at ?o1 ?o2))
	 :effect (and (not (at ?o1 ?o2))
		      (at ?o1 ?o3)))			    
)

; problem
(define (problem prob-snack)
  (:domain child-snack)
  (:objects kitchen -  place child1 -  child child2 -  child child3 -  child child4 -  child child5 -  child child7 -  child child6 -  child bread1 -  bread-portion bread2 -  bread-portion bread3 -  bread-portion bread4 -  bread-portion bread5 -  bread-portion bread6 -  bread-portion bread7 -  bread-portion content1 -  content-portion content2 -  content-portion content3 -  content-portion content4 -  content-portion content5 -  content-portion content6 -  content-portion content7 -  content-portion tray1 -  tray tray2 -  tray table1 -  place table2 -  place table3 -  place sandw1 -  sandwich sandw2 -  sandwich sandw3 -  sandwich sandw4 -  sandwich sandw5 -  sandwich sandw6 -  sandwich sandw7 -  sandwich sandw8 -  sandwich sandw9 -  sandwich sandw10 -  sandwich )
  (:init (at_kitchen_bread bread6) (no_gluten_bread bread5) (notexist sandw6) (waiting child3 table1) (no_gluten_content content7) (at_kitchen_content content5) (notexist sandw1) (waiting child6 table3) (at_kitchen_content content7) (allergic_gluten child7) (no_gluten_bread bread2) (waiting child1 table1) (at_kitchen_content content1) (not_allergic_gluten child3) (notexist sandw10) (no_gluten_content content6) (at_kitchen_bread bread7) (notexist sandw5) (waiting child4 table3) (notexist sandw3) (at_kitchen_content content2) (not_allergic_gluten child6) (allergic_gluten child4) (notexist sandw4) (at tray2 kitchen) (not_allergic_gluten child2) (waiting child7 table1) (at_kitchen_bread bread2) (at_kitchen_bread bread5) (notexist sandw2) (notexist sandw9) (waiting child2 table1) (at_kitchen_content content4) (waiting child5 table1) (at_kitchen_bread bread1) (at_kitchen_content content3) (at_kitchen_content content6) (at tray1 kitchen) (not_allergic_gluten child5) (notexist sandw7) (notexist sandw8) (not_allergic_gluten child1) (at_kitchen_bread bread4) (at_kitchen_bread bread3) )
  (:goal (and (no_gluten_bread bread5)(waiting child3 table1)(no_gluten_content content7)(notexist sandw1)(waiting child6 table3)(at_kitchen_content content7)(allergic_gluten child7)(no_gluten_bread bread2)(waiting child1 table1)(not_allergic_gluten child3)(no_gluten_content content6)(notexist sandw5)(waiting child4 table3)(not_allergic_gluten child6)(allergic_gluten child4)(notexist sandw4)(at tray2 kitchen)(not_allergic_gluten child2)(waiting child7 table1)(at_kitchen_bread bread5)(waiting child2 table1)(waiting child5 table1)(at tray1 kitchen)(not_allergic_gluten child5)(notexist sandw7)(not_allergic_gluten child1)(at_kitchen_sandwich sandw10)(at_kitchen_sandwich sandw3)(at_kitchen_sandwich sandw6)(at_kitchen_sandwich sandw8)(at_kitchen_sandwich sandw9)(at_kitchen_sandwich sandw2)(no_gluten_sandwich sandw2)(not (at_kitchen_bread bread1))(not (at_kitchen_bread bread2))(not (at_kitchen_bread bread3))(not (at_kitchen_bread bread4))(not (at_kitchen_bread bread6))(not (at_kitchen_bread bread7))(not (at_kitchen_content content1))(not (at_kitchen_content content2))(not (at_kitchen_content content3))(not (at_kitchen_content content4))(not (at_kitchen_content content5))(not (at_kitchen_content content6))(not (at_kitchen_sandwich sandw1))(not (at_kitchen_sandwich sandw4))(not (at_kitchen_sandwich sandw5))(not (at_kitchen_sandwich sandw7))(not (no_gluten_bread bread1))(not (no_gluten_bread bread3))(not (no_gluten_bread bread4))(not (no_gluten_bread bread6))(not (no_gluten_bread bread7))(not (no_gluten_content content1))(not (no_gluten_content content2))(not (no_gluten_content content3))(not (no_gluten_content content4))(not (no_gluten_content content5))(not (ontray sandw1 tray1))(not (ontray sandw1 tray2))(not (ontray sandw2 tray1))(not (ontray sandw2 tray2))(not (ontray sandw3 tray1))(not (ontray sandw3 tray2))(not (ontray sandw4 tray1))(not (ontray sandw4 tray2))(not (ontray sandw5 tray1))(not (ontray sandw5 tray2))(not (ontray sandw6 tray1))(not (ontray sandw6 tray2))(not (ontray sandw7 tray1))(not (ontray sandw7 tray2))(not (ontray sandw8 tray1))(not (ontray sandw8 tray2))(not (ontray sandw9 tray1))(not (ontray sandw9 tray2))(not (ontray sandw10 tray1))(not (ontray sandw10 tray2))(not (no_gluten_sandwich sandw1))(not (no_gluten_sandwich sandw3))(not (no_gluten_sandwich sandw4))(not (no_gluten_sandwich sandw5))(not (no_gluten_sandwich sandw6))(not (no_gluten_sandwich sandw7))(not (no_gluten_sandwich sandw8))(not (no_gluten_sandwich sandw9))(not (no_gluten_sandwich sandw10))(not (allergic_gluten child1))(not (allergic_gluten child2))(not (allergic_gluten child3))(not (allergic_gluten child5))(not (allergic_gluten child6))(not (not_allergic_gluten child4))(not (not_allergic_gluten child7))(not (served child1))(not (served child2))(not (served child3))(not (served child4))(not (served child5))(not (served child6))(not (served child7))(not (waiting child1 kitchen))(not (waiting child1 table2))(not (waiting child1 table3))(not (waiting child2 kitchen))(not (waiting child2 table2))(not (waiting child2 table3))(not (waiting child3 kitchen))(not (waiting child3 table2))(not (waiting child3 table3))(not (waiting child4 kitchen))(not (waiting child4 table1))(not (waiting child4 table2))(not (waiting child5 kitchen))(not (waiting child5 table2))(not (waiting child5 table3))(not (waiting child6 kitchen))(not (waiting child6 table1))(not (waiting child6 table2))(not (waiting child7 kitchen))(not (waiting child7 table2))(not (waiting child7 table3))(not (at tray1 table1))(not (at tray1 table2))(not (at tray1 table3))(not (at tray2 table1))(not (at tray2 table2))(not (at tray2 table3))(not (notexist sandw2))(not (notexist sandw3))(not (notexist sandw6))(not (notexist sandw8))(not (notexist sandw9))(not (notexist sandw10)))))

; plan
1. (make_sandwich sandw10 bread3 content2)
   deleted: (at_kitchen_bread bread3) (at_kitchen_content content2) (notexist sandw10)
   added: (at_kitchen_sandwich sandw10)
   goals met: 114 of 135
2. (make_sandwich sandw3 bread6 content5)
   deleted: (at_kitchen_bread bread6) (at_kitchen_content content5) (notexist sandw3)
   added: (at_kitchen_sandwich sandw3)
   goals met: 118 of 135
3. (make_sandwich sandw6 bread7 content3)
   deleted: (at_kitchen_bread bread7) (at_kitchen_content content3) (notexist sandw6)
   added: (at_kitchen_sandwich sandw6)
   goals met: 122 of 135
4. (make_sandwich sandw8 bread1 content4)
   deleted: (at_kitchen_bread bread1) (at_kitchen_content content4) (notexist sandw8)
   added: (at_kitchen_sandwich sandw8)
   goals met: 126 of 135
5. (make_sandwich sandw9 bread4 content1)
   deleted: (at_kitchen_bread bread4) (at_kitchen_content content1) (notexist sandw9)
   added: (at_kitchen_sandwich sandw9)
   goals met: 130 of 135
6. (make_sandwich_no_gluten sandw2 bread2 content6)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content6) (notexist sandw2)
   added: (at_kitchen_sandwich sandw2) (no_gluten_sandwich sandw2)
   goals met: 135 of 135
